[
  {
    "path": "posts/2021-11-29-eds-222-final-blog/",
    "title": "Are California Wildfires Getting more Intense in the North or South?",
    "description": "EDS 222 Final Project: Exploring geographic trends of wildfire intensity in California over time",
    "author": [
      {
        "name": "Felicia Cruz",
        "url": {}
      }
    ],
    "date": "2021-12-02",
    "categories": [
      "MEDS",
      "Statistics"
    ],
    "contents": "\n\nContents\nIntroduction\nData Description\nAnalysis Plan\nResults\nLinear regression (acres_burned~started)\nInteraction model\nWinsorization at the 99th percentile\n\nFurther Analysis\nReferences\n\nIntroduction\nGrowing up in the Antelope Valley, located in the Mojave Desert at the northern edge of LA County, I experienced wildfires at a very young age. As I grew up, orange haze outside, flying ash, and evacuation announcements on the news were not out of the ordinary during the later summer months. I will never forget taking a day trip to the beach with my family one summer only to come home to barricades outside our neighborhood because a wildfire had jumped the nearby ridge deeming it unsafe to enter. While our house, and my dog inside, was thankfully intact, we were reminded of the event for months by the charred hill next to our house.\nThe statistics describing the frequency, intensity, and destructiveness of California wildfires are alarming to say the least, and are all likely to be further exacerbated by the climate crisis in the years to come. As temperature and droughts increase with elevated greenhouse gas emissions, it is probable that we can expect more wildfires in the future, especially with the fire seasons getting longer.\nIn the past couple decades, California’s wildfire season has progressively gotten worse. A recent study by researchers at UC Irvine found that the annual burn season has lengthened since 2000 and that the yearly peak has shifted from August to July. In recent years especially, fires are getting both more intense and more frequent. For example, the 2017 season was the most destructive wildfire season on record at the time, with 1.2 million acres burned. The largest fire during that season was the Thomas Fire in Santa Barbara County, which was California’s largest modern wildfire at the time. In 2020, 4.2 million acres were burned, amounting to more than 4% of the state’s total land. This resulted in 2020 being the largest wildfire season recorded in California’s modern history. The August 2020 Complex Fire alone burned more than 1 million acres, making it the first “gigafire” on record.\n\n\nShow code\n\n# total acres burned by year and region \n\nacres_by_region <- fires_sub %>% \n  group_by(started_year, north_south) %>% \n  summarize(total_acres = sum(acres_burned, na.rm = TRUE))\n\ntotal_acres <- ggplot(acres_by_region, aes(x = started_year, y = total_acres,\n                                           color = north_south)) +\n  geom_line() +\n  labs(title = \"Total Acres Burned by Year\",\n       color = \"\",\n       x = \"Year\",\n       y = \"Acres\")\n\ntotal_acres\n\n\n\n\nFigure 1: Total Acres Burned (2013-2019). Acres burned in the North spiked in 2018, followed by a large drop-off in 2019.\n\n\n\nI am interested in how the intensity of California wildfires has changed over time, and if this change is different in the north compared to the south. Are California wildfires getting more intense in the northern part of the state or in the south? Is there a difference in trends between start date and acres burned for fires in the north versus fires in the South?\nFrom my preliminary research, there does not seem to be existing evidence on this question. While many articles discuss trends in wildfire season as a whole and factors that contribute to the growing wildfires in California, there is not much to be said about how geographic location is potentially correlated with changes in wildfires over time.\nData Description\nTo explore changes in California’s wildfire season and compare trends in the North to the South, I will be using a dataset which contains over 1,600 wildfire events in the state between 2013 and 2020. This dataset is made available on Kaggle.com and was originally scraped from records on the CAL FIRE website. For each fire, this dataset contains 40 variables; for the purposes of this analysis, the most relevant variables include latitude and longitude, start date, and acres burned. A potential limitation of this dataset is that it only includes wildfires responded to by CAL FIRE; many wildfire events that contribute to the overall trends in the north and the south may not be included in this dataset.\nThe dataset can be found here: https://www.kaggle.com/ananthu017/california-wildfire-incidents-20132020\nAnalysis Plan\nBefore looking at differences in geographic trends, I will first explore how start date affects wildfire intensity by running the following regression:\n\\[acres\\_burned_i=\\beta_{0}+\\beta_{1} \\cdot started_i + \\varepsilon_i\\]\nNext, in order to assess the effects of wildfire start date and location on the number of acres burned, I will be using the following interaction model:\n\\[acres\\_burned_i=\\beta_{0}+\\beta_{1} \\cdot started_i + \\beta_{2} \\cdot north\\_south_i + \\beta_{3} \\cdot started_i \\cdot north\\_south_i + \\varepsilon_i\\] The variable north_south takes on a value of “North” for all wildfires occurring above 36 degrees latitude, and everything below this is assigned “South”. I have chosen this interaction model in order to see if wildfire trends differ in the north and south.\nAfter running this regression, I will determine if the slope coefficients are statistically significant by looking at the associated p-values.\nLastly, due to many extreme values resulting from record-breaking fires in recent years, I will winsorize my data at the 99th percentile to try to eliminate some noise and see if my regression results change.\nResults\nLinear regression (acres_burned~started)\nFrom the first linear regression exploring the effects of start date on wildfire intensity, we can see that for every one day increase in the start date, there is a 1.08 increase in the number of acres burned. While this shows a positive trend, these results are not significant, as the p-values for both the intercept and the slope are quite high.\n\n\nShow code\n\nmod_1 <- lm(acres_burned ~ started, data = fires_sub)\n\nmod_1_summary <- mod_1 %>% \n  summary() %>% \n  xtable() %>% \n  kable(caption = \"Linear Regression of Acres Burned on Start Date\",\n        digits = 2) %>% \n  kable_styling(latex_options = \"HOLD_position\")\n\nmod_1_summary\n\n\n\nTable 1: Linear Regression of Acres Burned on Start Date\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n-13959.94\n\n\n17060.52\n\n\n-0.82\n\n\n0.41\n\n\nstarted\n\n\n1.08\n\n\n0.99\n\n\n1.09\n\n\n0.28\n\n\nInteraction model\nAfter including an interaction term for the California region a wildfire occurred in, we see a difference in slopes for the two regions. From Table 2, we can see that the intercept for fires that occur in the South is 24,345 acres above the intercept for fires in the South. Despite the higher intercept for fires in the South, the slope of the regression line is 1.56 less than that of the regression line for fires in the North. In other words, the trend line for northern fires is steeper despite a lower intercept. Just like our first regression results, the p-values are very high. While this model does show a difference in slopes, these results are not statistically significant and, therefore, there is not enough evidence to reject the hypothesis that there is a difference in the trends of wildfire intensity over time due to geographic location.\n\n\nShow code\n\nmod_2 <- lm(acres_burned ~ started + north_south + started*north_south, data = fires_sub)\n\nmod_2_summary <- mod_2 %>% \n  summary() %>% \n  xtable() %>% \n  kable(caption = \"Multiple Linear Regression\",\n        digits = 2) %>% \n  kable_styling(latex_options = \"HOLD_position\")\n\nmod_2_summary\n\n\n\nTable 2: Multiple Linear Regression\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n-21405.07\n\n\n22705.70\n\n\n-0.94\n\n\n0.35\n\n\nstarted\n\n\n1.57\n\n\n1.31\n\n\n1.19\n\n\n0.23\n\n\nnorth_southSouth\n\n\n24344.65\n\n\n34590.61\n\n\n0.70\n\n\n0.48\n\n\nstarted:north_southSouth\n\n\n-1.56\n\n\n2.01\n\n\n-0.78\n\n\n0.44\n\n\n\n\nShow code\n\nggplot(data = fires_sub, aes(x = started, y = acres_burned, color = north_south)) +\n  geom_point(alpha = 0.4) +\n  geom_line(data = augment(mod_2), aes(y = .fitted, color = north_south)) +\n  labs(title = \"\",\n       x = \"Start Date\",\n       y = \"Acres Burned\",\n       color = \"\") +\n  theme(plot.caption.position = \"plot\",\n        plot.caption = element_text(hjust = 0))\n\n\n\n\nFigure 2: Acres Burned vs. Start Date and Region\n\n\n\nWinsorization at the 99th percentile\nIn an attempt to eliminate some of the noise caused by this wildfire event data, I decided to winsorize my acres_burned values at the 99th percentile (90,288 acres).\n\n\nShow code\n\nfires_wins <- fires_sub %>% \n  filter(!is.na(acres_burned))\n\nfires_wins <- fires_wins %>% \n  mutate(acres_burned = \n           if_else(\n             acres_burned > quantile(acres_burned, probs = c(.99)),\n             quantile(acres_burned, probs = c(.99)),\n             acres_burned)) \n\n\n\nComparing these results to the previous regression before winsorization, \\(\\beta_{1}\\), the slope of the line for fires occurring in northern California, is smaller. Additionally, the slope for the South regression line after winsorization is -0.45, compared to a barely positive slope previously.\nThe p-value for the coefficient on the interaction term decreases after winsorization from 0.44 to 0.31, but it is still far too high to reject the hypothesis that there are different trends in California wildfire intensity based on region.\n\n\nShow code\n\n# new multiple regression model after winsorization \n\nmod_4 <- lm(acres_burned ~ started + north_south + started*north_south, data = fires_wins)\n\nmod_4_summary <- mod_4 %>% \n  summary() %>% \n  xtable() %>% \n  kable(caption = \"Multiple linear regression after winsorization at the 99th percentile\",\n        digits = 2) %>% \n  kable_styling(latex_options = \"HOLD_position\")\n\nmod_4_summary\n\n\n\nTable 3: Multiple linear regression after winsorization at the 99th percentile\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n-4783.42\n\n\n10434.59\n\n\n-0.46\n\n\n0.65\n\n\nstarted\n\n\n0.49\n\n\n0.60\n\n\n0.81\n\n\n0.42\n\n\nnorth_southSouth\n\n\n14905.85\n\n\n15896.39\n\n\n0.94\n\n\n0.35\n\n\nstarted:north_southSouth\n\n\n-0.94\n\n\n0.92\n\n\n-1.02\n\n\n0.31\n\n\n\n\nShow code\n\nggplot(data = fires_wins, aes(x = started, y = acres_burned, color = north_south)) +\n  geom_point(alpha = 0.4) +\n  geom_line(data = augment(mod_4), aes(y = .fitted)) +\n  labs(title = \"\",\n       x = \"Start Date\",\n       y = \"Acres Burned\",\n       color = \"\") +\n  theme(plot.caption.position = \"plot\",\n        plot.caption = element_text(hjust = 0))\n\n\n\n\nFigure 3: Acres Burned vs. Start Date and Region after Winsorization\n\n\n\nLastly, after winsorizing acres_burned at the 99th percentile, I decided to drop the observations above the 99th percentile entirely as a sensitivity check for my model. After re-running my interaction model, based on the results in Table 4 it does seem that my original model was sensitive to the outliers. Now, the p-value for the interaction term is 0.03 which is so much lower than the original results and the winsorized results. While this would suggest significance at the 5% level, I think more analysis would need to be done to see if dropping outliers is the appropriate route to take.\n\n\nShow code\n\n# drop observation if above the 99th percentile \nfires_drop_99 <- fires_sub %>% \n  filter(acres_burned <= 90288)\n\n# run regression again \nmod_5 <- lm(acres_burned ~ started + north_south + started*north_south, data = fires_drop_99)\n\nmod_5_summary <- mod_5 %>% \n  summary() %>% \n  xtable() %>% \n  kable(caption = \"Multiple linear regression after removing observations above the 99th percentile\",\n        digits = 2) %>% \n  kable_styling(latex_options = \"HOLD_position\")\n\nmod_5_summary\n\n\n\nTable 4: Multiple linear regression after removing observations above the 99th percentile\n\n\n\n\nEstimate\n\n\nStd. Error\n\n\nt value\n\n\nPr(>|t|)\n\n\n(Intercept)\n\n\n-4174.55\n\n\n7611.38\n\n\n-0.55\n\n\n0.58\n\n\nstarted\n\n\n0.39\n\n\n0.44\n\n\n0.89\n\n\n0.37\n\n\nnorth_southSouth\n\n\n23747.00\n\n\n11568.90\n\n\n2.05\n\n\n0.04\n\n\nstarted:north_southSouth\n\n\n-1.42\n\n\n0.67\n\n\n-2.12\n\n\n0.03\n\n\nFurther Analysis\nOverall, more data would be needed to perform a more robust and comprehensive analysis to accurately assess how regional location affects the trends in wildfire intensity in California over time. This dataset is vry limited in that it only includes wildfire events during a seven year span from 2013-2019. To get a more representative picture of the trends in acres burned for northern and southern wildfires in California over time, a much larger temporal range is needed. Additionally, 2020 data was not included which means observations from the largest fire season on record are not taken into account here. With more data points spanning a 20-30 year period, I suspect much more interesting and informative results.\nBeyond doing a regression analysis to explore differences in geographic trends in wildfire intensity over time, doing time series analyses to produce predictions of wildfire intensity would also be useful. This type of analysis would be of interest to government organizations, first responders in California, and the general public living in fire-prone areas of the state.\nLastly, looking at seasonal trends over time can help identify if and how the wildfire season itself is changing. This type of analysis could help answer other questions such as: Is the wildfire season in California getting longer? Are more intense wildfires happening at a certain point in the season?\nLink to my GitHub repository: https://github.com/fmcruz23/fmcruz23.github.io/tree/main/_posts/2021-11-29-eds-222-final-blog\nReferences\nCalifornia Department of Forestry and Fire Protection (CAL FIRE). “2018 Incident Archive.” Cal Fire Department of Forestry and Fire Protection, https://www.fire.ca.gov/incidents/2018/.\nCalifornia Department of Forestry and Fire Protection (CAL FIRE). “2020 Incident Archive.” Cal Fire Department of Forestry and Fire Protection, https://www.fire.ca.gov/incidents/2020/.\n“California’s Wildfire Season Has Lengthened, and Its Peak Is Now Earlier in the Year.” (GSTDTAP): California’s Wildfire Season Has Lengthened, and Its Peak Is Now Earlier in the Year, 22 Apr. 2021, http://resp.llas.ac.cn/C666/handle/2XK7JSWQ/323227.\n“One Reason for Northern California’s Terrible Fire Season: Less Rain than Southern California.” Los Angeles Times, Los Angeles Times, 1 Oct. 2020, https://www.latimes.com/california/story/2020-10-01/northern-california-fire-season-less-rain-than-southern-california.\nSadegh, Mojtaba, et al. “The Year the West Was Burning: How the 2020 Wildfire Season Got so Extreme.” ScholarWorks, https://scholarworks.boisestate.edu/civileng_facpubs/149/.\n\n\n\n",
    "preview": "posts/2021-11-29-eds-222-final-blog/2021-fire-map.png",
    "last_modified": "2021-12-02T11:37:27-08:00",
    "input_file": "eds-222-final-blog.knit.md",
    "preview_width": 920,
    "preview_height": 824
  },
  {
    "path": "posts/2021-10-20-data-retrieval/",
    "title": "Using an API to Programmatically Access and Download Data",
    "description": "Using the `dataRetrieval` package to analyze USGS datasets",
    "author": [
      {
        "name": "Felicia Cruz",
        "url": {}
      }
    ],
    "date": "2021-11-02",
    "categories": [
      "packages",
      "MEDS"
    ],
    "contents": "\n\nContents\nTime Series for 2021\nMontecito Mudslides: January 9, 2018\nTakeaways\n\nDuring my EDS 213 course titled “Metadata Standards, Data Modeling and Data Semantics” I learned how to use an API to programmatically retrieve data.\nUsing the dataRetrieval package to access USGS water gauge data, I will be looking at the Ventura River and Santa Paula Creek gauges to explore rain events and patterns.\nTime Series for 2021\n\n\nShow code\n\n# Query both sites at once by passing in a vector for the siteNumber argument  \n# Ventura is 1111850\n# Santa Paula is 1111350\n\n# subset for just 2021 \ncombined <- readNWISdv(siteNumber = c(\"11118500\", \"11113500\"),\n                       parameterCd = \"00060\",\n                       startDate = \"2021-01-01\",\n                       endDate = \"2021-11-01\") \n\n# rename the discharge column and drop the unnecessary variables \ncombined$discharge <- combined$X_00060_00003\ncombined <- combined %>% \n  select(site_no, Date, discharge) %>% \n  mutate(site_no = case_when(site_no == \"11118500\" ~ \"Ventura\",\n            TRUE ~ \"Santa Paula\"))\n\n\n\nOne of my favorite things about living in the Santa Barbara area is the beautiful weather. With sunny skies and warm temperatures most days, I have become quite sensitive to even small drops in temperature or brief rain episodes. In 2021, we have experienced very little rain thus far. From the plot below, we can see that the highest level of water discharge for either site was less than 15 cubic feet per second. Besides this spike, levels were consistently under 5 cubic feet per second.\n\n\nShow code\n\n# make a time series plot with both sites \n\nggplot(data = combined, aes(x = Date, y = discharge)) +\n  geom_line(aes(color = site_no)) +\n  ylim(0, 15) +\n  labs(title = \"Water Discharge, Santa Paula and Ventura\",\n       subtitle = \"2021-01-01 - 2021-11-01\",\n       color = \"Site\",\n       y = \"Discharge (cubic ft/s)\")\n\n\n\n\nMontecito Mudslides: January 9, 2018\nThe Thomas Fire in December of 2018 ended my first quarter of college early and postponed my first finals week. Once the fire was contained after the holidays, I thought I would be returning to a somewhat normal college experience…until the Montecito Mudslides happened.\nJust as the Thomas Fire was nearing complete containment, heavy rainfall on January 9, 2019 washed away massive amounts of mud and debris loosened from the areas burned by the fire. These mudslides sadly resulted in 23 deaths and the destruction of around 100 residences. After a quick weekend trip home in January, the Highway 101 closure due to these mudslides meant in order to get back to school I needed to take a short boat trip from Ventura Harbor to Santa Barbara.\nIn the time series plot above, I used the readNWISdv to retrieve daily values of water discharge. By using the readNWISuv function, I can download data that includes readings for every 15 minutes on a given day. Filtering for January 9, 2018, I can look at the frequency and intensity of rainfall for this particular day.\n\n\nShow code\n\n# getting instantaneous data for January 9 to look at water discharge \n\ncombined_jan_9_18 <- readNWISuv(siteNumbers =  c(\"11118500\", \"11113500\"),\n                       parameterCd = \"00060\",\n                       startDate = \"2018-01-09\",\n                       endDate = \"2018-01-09\",\n                       tz = \"America/Los_Angeles\")\n\ncombined_jan_9_18$discharge <- combined_jan_9_18$X_00060_00000\n\ncombined_jan_9_18 <- combined_jan_9_18 %>% \n  select(site_no, dateTime, discharge) %>% \n  mutate(site_no = case_when(site_no == \"11118500\" ~ \"Ventura\",\n            TRUE ~ \"Santa Paula\"))\n\nggplot(combined_jan_9_18, aes(x = dateTime, y = discharge)) +\n  geom_line(aes(color = site_no)) +\n  labs(y = \"Discharge (cubic ft/s)\",\n       color = \"Site\",\n       title = \"Water Discharge\",\n       subtitle = \"2018-01-09\",\n       x = \"Time\") \n\n\n\n\nFrom the above plot, we can see that water discharge peaked at around 6000 cubic feet per second at about 7 am on January 9. Compared to the maximum discharge in 2021 so far of 15 cubic feet per second, this highlights the intensity of the rainfall that triggered the Montecito Mudslides back in 2018. In a place of such low rainfall like Santa Barbara County, it is unlikely that such a massive rain event would occur and bring with it such devastating consequences, but the burn scars left by the Thomas Fire made these mudslides practically inevitable.\nTakeaways\nUsing an API to access and download data was extremely simple and fast. Instead of taking the time to download massive csv files off the internet to then use in an R script, using a package like dataRetrieval (or metajam which is used to access DataONE datasets) streamlines this process. It also makes it quick and easy to edit your code in case your dates or regions of interest change, as opposed to going back to the website to download another couple csv files.\n\n\n\n",
    "preview": "posts/2021-10-20-data-retrieval/images/dataretrieval_hex.png.crdownload",
    "last_modified": "2021-11-29T22:31:41-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-16-aug-16/",
    "title": "Two weeks as a MEDS student",
    "description": "A few functions I learned and key takeaways from my first two weeks in MEDS",
    "author": [
      {
        "name": "Felicia Cruz",
        "url": {}
      }
    ],
    "date": "2021-08-16",
    "categories": [
      "packages",
      "MEDS"
    ],
    "contents": "\nSome functions I have found particularly useful are group_by() and summarize(). Working together, these two functions will recognize groups that are specified in the arguments and then compute chosen summary statistics represented in a new data frame.\nHere is an example of how these functions can be used to find the mean flipper length for each penguin species in the palmerpenguins dataset.\n\n\nflipper_length_by_species <- penguins %>%\n  group_by(species) %>% \n  summarize(mean_flipper_length = mean(flipper_length_mm, na.rm = TRUE))\n\n\n\n\n# A tibble: 3 × 2\n  species   mean_flipper_length\n  <fct>                   <dbl>\n1 Adelie                   190.\n2 Chinstrap                196.\n3 Gentoo                   217.\n\nJust by using these two functions, from the new data frame we can quickly see that Gentoos have the longest flipper length on average.\nBeyond just learning useful functions, I have also deepened my understanding of tidy data. While I used to think that “tidy data” simply referred to datasets that were visually clean and organized, I have come to learn that tidy data refers to data that follows a certain structure. The three criteria that must be met for data to be considered “tidy” are:\nEach variable must be a column\nEach observation must be a row\nEach cell can contain only one value\nWhen data is in tidy form, this allows for easier visualizations and analyses.\nLastly, a key takeaway I have learned in my first two weeks as a data science student is that collaboration is critical. Whether collaboration means testing functions together or simply spotting an unmatched parentheses, I have really enjoyed the teammwork aspect that comes along with working in this field.\n\n\n\n",
    "preview": "posts/2021-08-16-aug-16/images/bren_outside.jpeg",
    "last_modified": "2021-11-01T14:28:12-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-10-a-function-i-learned/",
    "title": "Working with `ggplot`",
    "description": "Using `ggplot` with the `palmerpenguins` package",
    "author": [
      {
        "name": "Felicia Cruz",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [
      "packages"
    ],
    "contents": "\n\n\nShow code\n\nggplot(data = penguins, aes(x= flipper_length_mm, y = body_mass_g)) +\n  geom_point(aes(color = species)) + \n  labs(title = \"Flipper Length and Body Mass by Species\",\n       subtitle = \"Palmer Penguins\",\n       x = \"Flipper Length (mm)\",\n       y = \"Body Mass (g)\",\n       color = \"Species\") +\n  theme_gray()\n\n\n\n\nThis scatterplot shows a positive correlation between penguin flipper length and body mass. While the Adelie and Chinstrap species are similar in size, the Gentoos weigh a lot more and have much longer flippers.\n\n\n\n",
    "preview": "posts/2021-08-10-a-function-i-learned/images/palmerpenguins.jpg",
    "last_modified": "2021-11-02T16:12:26-07:00",
    "input_file": {}
  }
]
